<?php
$ip = sprintf("%u", ip2long('192.168.1.60'));
echo long2ip($ip) . '<hr />';
$file = 'files/cache/ip_wlist.dat'; // Файл кэша "белого" списка IP адресов

// Список надежных адресов
$ip_tmp = array (
    '127.0.0.1' => '',
    '192.168.0.1' => '192.168.0.100',
    '192.168.1.60' => '',
    '192.168.1.140' => '192.168.1.200',
    '192.168.2.1' => '192.168.2.250',
    '192.168.3.1' => '192.168.3.250',
    '192.168.4.1' => '192.168.4.250',
    '192.168.5.1' => '192.168.5.250',
    '192.168.6.1' => '192.168.6.250',
    '192.168.7.1' => '192.168.7.250',
    '192.168.8.1' => '192.168.8.250',
    '192.168.9.1' => '192.168.9.250',
    '192.168.10.1' => '192.168.10.250',
    '192.168.11.1' => '192.168.11.250'
);

// Записываем кэш "белых" адресов
foreach ($ip_tmp as $ip1 => $ip2) {
    $out[] = sprintf("%u", ip2long($ip1)) . ':' . sprintf("%u", ip2long($ip2));
}
if (!file_put_contents($file, implode("\r\n", $out))) {
    return 'IP Whitelist write error!';
    exit;
}

?>